## mesazon-apps-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gateway_core.digitalocean_app.app: Refreshing state... [id=987ef221-b14d-4bf0-9a10-8ba7bea60a9e]
module.gateway_flyway.digitalocean_app.app: Refreshing state... [id=c0ed55f1-6801-40fc-8d1c-5c18255630fb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.gateway_core.digitalocean_app.app is tainted, so must be replaced
-/+ resource "digitalocean_app" "app" {
      + active_deployment_id = (known after apply)
      ~ created_at           = "2026-02-05 21:34:27 +0000 UTC" -> (known after apply)
      + default_ingress      = (known after apply)
      ~ id                   = "987ef221-b14d-4bf0-9a10-8ba7bea60a9e" -> (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      ~ updated_at           = "2026-02-05 21:36:06 +0000 UTC" -> (known after apply)
      ~ urn                  = "do:app:987ef221-b14d-4bf0-9a10-8ba7bea60a9e" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ dedicated_ips (known after apply)

      ~ spec {
          ~ domains                         = [] -> (known after apply)
          ~ features                        = [
              - "buildpack-stack=ubuntu-22",
            ] -> (known after apply)
            name                            = "gateway-core-fra1-dev"
          ~ region                          = "fra" -> "fra1"
            # (3 unchanged attributes hidden)

          ~ domain (known after apply)

          ~ ingress (known after apply)
          - ingress {
              - rule {
                  - component {
                      - name                 = "gateway-core-service-fra1-dev" -> null
                      - preserve_path_prefix = false -> null
                        # (1 unchanged attribute hidden)
                    }
                  - match {
                      - path {
                          - prefix = "/" -> null
                        }
                    }
                }
            }

          ~ service {
              ~ http_port          = 8080 -> (known after apply)
              ~ internal_ports     = [] -> (known after apply)
                name               = "gateway-core-service-fra1-dev"
              + run_command        = "tail -f /dev/null"
                # (6 unchanged attributes hidden)

              ~ image {
                  ~ registry_credentials = (sensitive value)
                    # (5 unchanged attributes hidden)

                  ~ deploy_on_push (known after apply)
                }

              ~ routes (known after apply)
            }
        }
    }

  # module.gateway_flyway.digitalocean_app.app is tainted, so must be replaced
-/+ resource "digitalocean_app" "app" {
      + active_deployment_id = (known after apply)
      ~ created_at           = "2026-02-05 21:34:27 +0000 UTC" -> (known after apply)
      + default_ingress      = (known after apply)
      ~ id                   = "c0ed55f1-6801-40fc-8d1c-5c18255630fb" -> (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      ~ updated_at           = "2026-02-05 21:35:10 +0000 UTC" -> (known after apply)
      ~ urn                  = "do:app:c0ed55f1-6801-40fc-8d1c-5c18255630fb" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ dedicated_ips (known after apply)

      ~ spec {
          ~ domains                         = [] -> (known after apply)
          ~ features                        = [
              - "buildpack-stack=ubuntu-22",
            ] -> (known after apply)
            name                            = "gateway-flyway-fra1-dev"
          ~ region                          = "fra" -> "fra1"
            # (3 unchanged attributes hidden)

          ~ domain (known after apply)

          ~ ingress (known after apply)
          - ingress {
            }

          ~ job {
              ~ kind               = "POST_DEPLOY" -> "UNSPECIFIED"
                name               = "gateway-flyway-job-fra1-dev"
                # (7 unchanged attributes hidden)

              ~ image {
                  ~ registry_credentials = (sensitive value)
                    # (5 unchanged attributes hidden)

                  ~ deploy_on_push (known after apply)
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: No active deployment found for app: gateway-flyway-fra1-dev (c0ed55f1-6801-40fc-8d1c-5c18255630fb)

  with module.gateway_flyway.digitalocean_app.app,
  on ../../modules/app-job-noop/main.tf line 10, in resource "digitalocean_app" "app":
  10: resource "digitalocean_app" "app" {


Warning: No active deployment found for app: gateway-core-fra1-dev (987ef221-b14d-4bf0-9a10-8ba7bea60a9e)

  with module.gateway_core.digitalocean_app.app,
  on ../../modules/app-service-noop/main.tf line 10, in resource "digitalocean_app" "app":
  10: resource "digitalocean_app" "app" {


─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>